<h3>Online-Material zu <b>Patterns kompakt</b></h3>
<p />
Hier m&ouml;chten wir unseren Lesern weitere Diagramme, Beispielszenarien
und <a href="#CODE">Codebeispiele</a> zur Verf&uuml;gung stellen, f&uuml;r die im Buch kein
Raum ist.
<p />
Das Material ist nach dem Motto <i>einsteigen und losfahren</i> 
aufgebaut. Nur selten gibt es Abh&auml;ngigkeiten zwischen den Beispielen, so dass
Sie sich auf ein Pattern konzentrieren k&ouml;nnen.<br />
Ganz bewusst haben wir jeweils ein anderes Szenario
als im Buch gew&auml;hlt.<br />
Das soll Ihnen die M&ouml;glichkeit geben, das Muster
noch einmal aus einem anderen Blickwinkel zu betrachten.
<p />
Jedes Pattern ist lauff&auml;hig in Form eines Testcases. Spielen Sie mit den
Log-Leveln, oder f&uuml;hren Sie weitere Debug-Ausgaben ein, wenn Ihnen etwas
unklar sein sollte. Denken Sie auch ruhig mal dar&uuml;ber nach, ob das jeweils demonstrierte
Pattern in dem Szenario der Wei&szlig;heit letzter Schluss ist, oder
ob ein anderes vielleicht besser passen w&uuml;rde!
<p />
Wir laden Sie zum Ausprobieren, Experimentieren und Kritisieren ein.
Berichten Sie uns von Ihren Erfahrungen und wo Sie Entwurfsmuster
bereits erfolgreich anwenden konnten.
<p />
Viel Erfolg und vor allem Spa&szlig; bei Ihrer Arbeit!
<p />
<a href="mailto:Karl.Eilebrecht(a/t)calamanari.de">Karl Eilebrecht</a>, <a href="mailto:gs@gernotstarke.de">Gernot Starke</a><br />
Dezember 2020
<p />
&nbsp;
<p />
<a name="CODE" />
<h3>Code-Beispiele</h3>
Neben der M&ouml;glichkeit, sich die API der Klassen mit verlinktem Source-Code <a href="./javadoc/index.html" target="blank">online anzuschauen</a>, k&ouml;nnen Sie das Projekt mit den Codebeispielen hier herunterladen: 
<h4><a href="./download/pk-examples.zip">Download pk-examples.zip</a></h4>
<p />
<i>&Auml;ltere Versionen:</i>
<ul>
<li><a href="./download/pk-examples-j6.zip">Download pk-examples_j6.zip</a> (2012, JDK 6)</li>
<li><a href="./download/pk-examples-j7.zip">Download pk-examples_j7.zip</a> (2014, JDK 7)</li>
<li><a href="./download/pk-examples-j11.zip">Download pk-examples_j11.zip</a> (2019, JDK 11)</li>
</ul>
<p />
Es hat sich zum Standard entwickelt, viele Basisfunktionali&auml;ten mit Bibliotheken
abzudecken, die als externe Dependencies deklariert und aus Repositories geladen werden.<br />
Bis einschlie&szlig;lich Java 7 haben wir noch versucht, ohne solche zus&auml;tzlichen Abh&auml;ngigkeiten auszukommen, weil
das f&uuml;r Neulinge die H&uuml;rden erh&ouml;ht, Beispiele einfach mal auszuprobieren.<br /><br />
Mittlerweile wird ein solcher Insel-Entwicklungsansatz aber immer schwieriger (verschlanktes JDK) und ist zunehmend fragw&uuml;rdig, weil er einfach <i>Best Practices</i> widerspricht.<br />
Daher sind die Code-Beispiele jetzt als Maven-Projekt umgesetzt und setzen neben dem JDK 15 eine funktionierende Maven-Installation voraus.
<p />
Neben dem Archiv mit den Sourcen ben&ouml;tigen Sie:<br />
<ul>
<li>Java Platform (JDK) 15 (z.B. OpenJDK)</li>
<li>Apache Maven (3.6.3 oder neuer)</li>
</ul>
Zu empfehlen ist eine IDE wie <a href="http://www.eclipse.org/" target="_blank">Eclipse</a>. <br />
Wir haben au&szlig;erdem <a href="https://www.sonarlint.org/" target="_blank">SonarLint</a> im Einsatz.
<p />
&nbsp;
<p />
<h3>Das Letzte</h3>
Kennen Sie die <i>Pattern-Wette des Teufels</i>?<br />
Die Legende besagt, dass der Teufel (bildet sich 666 Stunden pro Tag weiter) irgendwann feststellte, dass es bei Entwurfsmustern
viele Details zu beachten gibt. <i>&quot;Details klingt gut&quot;</i>, grinste er, <i>&quot;da stecke ich drin!&quot;</i><br />
Seitdem erscheint er vielen Entwicklern im Traum <i>&quot;Wetten, dass Du es nicht schaffst, das folgende Pattern in Deinem
aktuellen Projekt einzusetzen? Falls doch, sollst Du ber&uuml;hmt werden, anderfalls wird das Projekt mein sein!&quot;</i>
<p />
Diese Wette gewinnt fast immer der Teufel <i>- so oder so ...</i>


